src/DataProcessors/РабочаяМЦ/РабочаяМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочаяМЦ</name>
  <attributes>
    <name>ИсточникДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧБаланс</name>
    <attributes>
      <name>МестоХраненияДС</name>
      <type>
        <types>CatalogRef.ИсточникХраненияДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОборот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКонечныйОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛимитКредита</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВНаличии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Баланс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаДокумент</name>
      <type>
        <types>DocumentRef.ВводОстатков</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПриход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/InformationRegisters/РС_Остатки_ДС_ПоВидуНакопления/РС_Остатки_ДС_ПоВидуНакопления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РС_Остатки_ДС_ПоВидуНакопления</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СуммаОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидИсточникаЗраненияДС</name>
    <type>
      <types>CatalogRef.ИсточникХраненияДС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/РН_МестаНакопленияДенег/РН_МестаНакопленияДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РН_МестаНакопленияДенег</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХраненияДС</name>
    <type>
      <types>CatalogRef.ИсточникХраненияДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтКогоКомуКуда</name>
    <type>
      <types>CatalogRef.КонтрагентМесто</types>
      <types>CatalogRef.ФизЛица</types>
      <types>String</types>
      <types>CatalogRef.Люди</types>
      <types>CatalogRef.Семья</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/DataProcessors/РабочаяМЦ/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ЗаполнитьТЧ(Команда)
	СозадниеТЧСЗапроса();
КонецПроцедуры

&НаСервере
Процедура СозадниеТЧСЗапроса()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РС_Остатки_ДС_ПоВидуНакопленияСрезПоследних.ВидИсточникаЗраненияДС КАК ВидИсточникаЗраненияДС,
		|	РС_Остатки_ДС_ПоВидуНакопленияСрезПоследних.Период КАК Период,
		|	РС_Остатки_ДС_ПоВидуНакопленияСрезПоследних.СуммаОстаток КАК СуммаОстаток,
		|	РС_Остатки_ДС_ПоВидуНакопленияСрезПоследних.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТОстатки
		|ИЗ
		|	РегистрСведений.РС_Остатки_ДС_ПоВидуНакопления.СрезПоследних КАК РС_Остатки_ДС_ПоВидуНакопленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОстатки.ВидИсточникаЗраненияДС КАК МестоХраненияДС,
		|	ВТОстатки.Период КАК Дата,
		|	РН_МестаНакопленияДенегОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
		|	РН_МестаНакопленияДенегОстаткиИОбороты.СуммаРасход КАК СуммаРасход,
		|	РН_МестаНакопленияДенегОстаткиИОбороты.СуммаОборот КАК СуммаОборот,
		|	РН_МестаНакопленияДенегОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
		|	ВТОстатки.СуммаОстаток КАК ВНаличии,
		|	ВТОстатки.Регистратор КАК СсылкаНаДокумент,
		|	РН_МестаНакопленияДенегОстаткиИОбороты.СуммаКонечныйОстаток - ВТОстатки.СуммаОстаток КАК Баланс
		|ИЗ
		|	ВТОстатки КАК ВТОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РН_МестаНакопленияДенег.ОстаткиИОбороты КАК РН_МестаНакопленияДенегОстаткиИОбороты
		|		ПО ВТОстатки.ВидИсточникаЗраненияДС.Ссылка = РН_МестаНакопленияДенегОстаткиИОбороты.МестоХраненияДС.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТОстатки.ВидИсточникаЗраненияДС.Владелец";

	РЗ = Запрос.Выполнить();
	ТЗ = РЗ.Выгрузить();
	Объект.ТЧБаланс.Загрузить(ТЗ); 
	
КонецПроцедуры 

&НаКлиенте
Процедура ТЧБалансВНаличииПриИзменении(Элемент)
	Тел = Элементы.ТЧБаланс.ТекущиеДанные; 
	Тел.Баланс =  Тел.СуммаКонечныйОстаток - Тел.ВНаличии;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Период.ДатаНачала = НачалоДня(ТекущаяДата());
	Период.ДатаОкончания = КонецДня(ТекущаяДата());
	ПередачаПараметровДС();
КонецПроцедуры

&НаКлиенте
Процедура ПередачаПараметровДС()
	ОМ_ДС.ПередПарам_ДС(РасходыЗаПериод,Период.ДатаНачала,"ДатаНач");
	ОМ_ДС.ПередПарам_ДС(РасходыЗаПериод,Период.ДатаОкончания,"ДатаКон");
КонецПроцедуры 

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПередачаПараметровДС();
КонецПроцедуры
